Courses/7140/Lectures/Specs/specs-101.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Software Specifications 101</title>
<!-- 2018-10-29 Mon 00:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a> | <a href="./index-slides.html">Slides</a>
</div>
<div id="content">
<h1 class="title">Software Specifications 101</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. About Specifications</a></li>
<li><a href="#sec-2">2. Notations For Specs</a></li>
<li><a href="#sec-3">3. Seven Sins of a Specifier</a></li>
<li><a href="#sec-4">4. Correct wrt Assertions</a></li>
<li><a href="#sec-5">5. Specs v Final Programs</a></li>
<li><a href="#sec-6">6. References</a></li>
</ul>
</div>
</div>
<p>
This is a "graduate level 101" intro to specs.
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About Specifications</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Spec Techniques</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Prescriptive/ Operational?
</li>
<li>Declarative  Preferred
</li>
<li>Another Program as a spec of this one?
</li>
<li>English v Math + Logic
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Specifications v Requirements</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>mostly a question of points of view 
</li>
<li>requ: POV of the clients/users
</li>
<li>spec: POV the designer/developer
</li>
<li>Should the Structure of Spec influence Design?
<ol class="org-ol">
<li>Explicit admonition
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Specifications meet Requirements</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Goal: Spec S meets requirements R: S \(\models\) R (S "models" R)
</li>
<li>How to verify? R is in English prose, S in some notations
</li>
<li>We seek consensus of humans readers: Give them S and R, and ask
"What do you think? Are they the same?"
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Different Axes of Specs</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Functional Specs
</li>
<li>Performance/ Resources Specs
</li>
<li>Maintainability
</li>
<li><a href="../Overview/hoare-quality-1972.pdf">A list of different specs by Hoare</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Functional Specifications</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>Input/Output relation
</li>
<li>Input = any thing the prg "reads" (depends on)
</li>
<li>Output =any thing the prg "writes" (generates)
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Performance Specifications</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>What and How-much is "consumed"?
<ol class="org-ol">
<li>CPU time, memory, stack, heap, file space, &#x2026;
</li>
</ol>
</li>
<li>Big-Oh notations?
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Robustness Specs</h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li>Must not crash (no matter what the inputs are?)
</li>
<li>Must not hang
</li>
<li>Must not do "disastrous" operations 
<ul class="org-ul">
<li>(e.g., delete hundreds of files)
</li>
<li>unless undo/redo are available
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Resource Specs</h3>
<div class="outline-text-3" id="text-1-8">
<ol class="org-ol">
<li>PL used
</li>
<li>RAM, CPU, speed
</li>
<li>man hours
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Miscellaneous Specifications</h3>
<div class="outline-text-3" id="text-1-9">
<ol class="org-ol">
<li>PL-, IDE tools, &#x2026; (to be used) 
</li>
<li>Source code, documentation, &#x2026; (to be produced)
</li>
<li>Software qualities expected [see Hoare's list]
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Notations For Specs</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Discrete Math
</li>
<li>Mathematical Logic
</li>
<li>Functional Programming
</li>
<li><a href="../Assertions/math-logic.html">../Assertions/math-logic.html</a>
</li>
</ol>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Formal or Informal?</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>What is rigor? precision? 
</li>
<li>Specification Languages 
</li>
<li>Another Program as a spec of this one?
</li>
<li>Can every existing program be specified?
</li>
<li>Is every spec "mathematically" specifiable? 
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Seven Sins of a Specifier</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><b>Noise</b> The presence in the document of an element that does not
carry information relevant to any feature of the problem. Variants:
redundancy; remorse.
</li>
<li><b>Silence</b> The existence of a feature of the problem that is not
covered by any element of the document.
</li>
<li><b>Overspecification</b> The presence in the document of an element that
corresponds not to a feature of the problem but to features of a
possible solution.
</li>
<li><b>Contradiction</b> The presence in the document of two or more elements
that define a feature of the system in an incompatible way.
</li>
</ol>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Seven Sins of a Specifier #2</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li><b>Ambiguity</b> The presence in the document of an element that makes it
possible to interpret a feature of the problem in at least two
different ways.
</li>
<li><b>Forward</b> Reference The presence in the document of an element that
uses features of the problem not defined until later in the
document.
</li>
<li><b>Wishful Thinking</b> The presence in the document of an element that
defines a feature of the problem in such a way that a candidate
solution cannot realistically be validated with respect to this
feature.
</li>
<li>[cite Bertrand Meyer, see Refs; visit also <a href="http://deadlysins.com">http://deadlysins.com</a>]
</li>
<li>Aren't these: Seven Sins of the <i>Requirements</i> Writer?
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Correct wrt Assertions</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>What is the notion of "correct" that you are using?
</li>
<li>It can never be a unary property.  A program is correct with
respect to (wrt) to something: another program, e.g.
</li>
<li>In this course it is never independent of its entry- and exit
assertions.
</li>
</ol>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Correct wrt Assertions: Vacuously</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>If we give impossible to hold entry assertion,
</li>
<li>or if we give trivial to hold exit assertion,
</li>
<li>then any program will be correct with respect to those assertions.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Correct wrt Assertions: For-All</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>There is an implicit <i>for-all</i> (symbol &forall;) in the assertions.
</li>
<li>E.g., when we write n &gt;= 0 in the entry assertions, it includes for
all n that we  may give so that n &gt;= 0.  The  n that is bound here
is taken in all subsequent assertions  &#x2013; in loop invariants and in
the exit assertion.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Correct wrt Assertions: sorting-alg Example</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>Our assertions for sorting:
</li>
</ol>
<pre class="example">
{n &gt;= 0} sorting-alg {sorted(a[0 .. n-1]) and permutation(a, a')}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Specs v Final Programs</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Expect that declarative specs are shorter than programs written in
languages like Java or C++.
</li>

<li>Not always so.  Consider the pseudo random number generators that
do <code>x = m*x + c</code>.  The initial choice of x, m and c have an impact
on the random number sequence.  The specification of this sequence
is considerably longer than the one liner implementation.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Meyer, Bertrand, <a href="http://se.ethz.ch/~meyer/publications/ieee/formalism.pdf">"On Formalism In Specifications"</a>, IEEE Software,
1985, vol. 2, no. 1. pp. 6-26.  (Meyer is the designer of the
excellent OOPL named Eiffel.)  Required Reading.
</li>

<li>Others and Bertrand Meyer, <a href="http://arxiv.org/pdf/1211.4775v2.pdf">"How Specifications Change and Why You
Should Care"</a>,  Jan 2013. Recommended Reading.
</li>

<li>Joel Spolsky, <a href="http://www.joelonsoftware.com/articles/fog0000000036.html">"Painless Functional Specifications - Part1. Why
Bother?"</a>, 2000.  "Painless Functional Specifications - Part 2:
What's a Spec?" "Painless Functional Specifications - Part 3:
But&#x2026; How?" "Painless Functional Specifications - Part 4: Tips"
(Spolsky is the designer and original builder of Stack Overflow.)
Recommended Reading.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-01-27
</div>
</body>
</html>
